In [7]:
# Gives us the filtering we want
sqldf('''
SELECT name, test_10_score FROM scores WHERE test_10_score BETWEEN 80 AND 90;
''')

       name  test_10_score
0      Noah             88
1       Ava             88
2    Sophia             81
3    Elijah             83
4  Isabella             86
5     James             88
6    Amelia             87
7     Lucas             90
8       Mia             89